# AreElementsNotConnectedInSeries Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet..::..AreElementsNotConnectedInSeries Method
MechanicalEquipmentSet Class See Also
---
Checks if the elements are not serially connected.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static bool AreElementsNotConnectedInSeries(
	Document document,
	ISet<ElementId> elemIds
)
```

Visual Basic
---
```text
Public Shared Function AreElementsNotConnectedInSeries ( _
	document As Document, _
	elemIds As ISet(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreElementsNotConnectedInSeries(
	Document^ document,
	ISet<ElementId^>^ elemIds
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document of these elements.
elemIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The element ids to be tested.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace